УТ_для_edt.РасширениеСмарт/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/HTTPServices/смартHTTPДляЗУП/Module.bsl
#Область ТочкаВхода
//Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 20.07.2021 13:31:31 задача 583
Функция смартЗагрузитьДанныеИзЗУП(Запрос)
		
	СтруктураВхПараметров = Новый Структура;
	СтруктураВхПараметров.Вставить("ТелоЗапроса",Запрос.ПолучитьТелоКакСтроку("UTF-8"));	
	
	//Передаем входящие параметры (Модуль для метода POST)
	СтруктураОтвет = смартОбработкаМетодовPOST(СтруктураВхПараметров);
	
	//Создаем ответ с кодом состояния
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета);
	Если СтруктураОтвет.Отработало Тогда 
	    Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвета,КодировкаТекста.UTF8);
	Иначе
		Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки,КодировкаТекста.UTF8);
	КонецЕсли;	
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
		
КонецФункции

//Смарт {[*](фрагмент ИЗМЕНЕН), Подкин Алексей Иванович 20.07.2021 13:31:31 задача 583
Функция смартОбработкаМетодовPOST(ПараматрыВходящие) 
		
	СтруктураОтвет = Новый Структура("ДанныеОтвета,Отработало,ТекстОшибки,КодОтвета","",Истина,"",400);	
	ТекстОшибки="";
	ТекстУспех="";
	
	ТекстXML="";

	ЗаписьЖурналаРегистрации("Получены физ. лица, фоновое задание, запуск!!!",УровеньЖурналаРегистрации.Предупреждение,,,);
	Если ПараматрыВходящие.Свойство("ТелоЗапроса") и ЗначениеЗаполнено(ПараматрыВходящие.ТелоЗапроса) Тогда
		ТекстXML=ПараматрыВходящие.ТелоЗапроса;
		ЗаписьЖурналаРегистрации("Получены физ. лица, из базы ЗуП",УровеньЖурналаРегистрации.Информация,,ТекстXML,);
	иначе
		
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,"Не найден текст выгрузки физ. лиц!",Ложь,"");
		Возврат СтруктураОтвет;
		
	КонецЕсли; 
	
	АдресРезультата = ПолучитьИмяВременногоФайла("xml");
	Обработка = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	РезультатЗагрузки = Обработка.ЗагрузитьДанныеИзXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	Если РезультатЗагрузки.ЕстьОшибки тогда
		Сообщить(РезультатЗагрузки.ТекстОшибки); 
		ЗаполнитьСтруктуруОтвета(СтруктураОтвет,400,"Ошибка загрузки физ. лица.",Ложь,"");
		Возврат СтруктураОтвет;
	КонецЕсли;
	
	Для Каждого ЗагруженнаяСтрока из РезультатЗагрузки.ЗагруженныеОбъекты Цикл
		Если ТипЗнч(ЗагруженнаяСтрока.Ссылка)=тип("СправочникСсылка.ФизическиеЛица") Тогда
			ЗаполнитьСтруктуруОтвета(СтруктураОтвет,200,"",Истина,Строка(ЗагруженнаяСтрока.Ссылка) + " создан/изменен элемент справочника Физ.лица!");
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураОтвет;
	
КонецФункции

//++ #Б3636 смарт: Шляпников 01.07.2025 / Передача из ЗУП в УТ данных об отпусках сотрудников.
Функция ЗагрузкаДанныхОбОтпускахPOST(Запрос)
	
	Попытка
		Данные = смартОбщегоНазначения.JSONВЗначение(смартОбщегоНазначения.ВосстановитьСтрокуИзСжатой(Запрос.ПолучитьТелоКакСтроку()),, Ложь);
	Исключение
		
		Ошибка = СтрШаблон("Не удалось прочитать полученные данные по причине : %1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("смартHTTPДляЗУП.ЗагрузкаДанныхОбОтпускахPOST", УровеньЖурналаРегистрации.Ошибка,,, Ошибка);
		Ответ = Новый HTTPСервисОтвет(401);
		Ответ.УстановитьТелоИзСтроки(Ошибка);
		Возврат Ответ;
	
	КонецПопытки;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ИНН", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("ДатаНачала", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТЗ.Колонки.Добавить("ДатаОкончания", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТЗ.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	Для каждого стрДанные Из Данные Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.ИНН = стрДанные.ИНН;
		НоваяСтрока.ДатаНачала = ПрочитатьДатуJSON(стрДанные.ДатаНачала, ФорматДатыJSON.ISO);
		НоваяСтрока.ДатаОкончания = ПрочитатьДатуJSON(стрДанные.ДатаОкончания, ФорматДатыJSON.ISO);
		НоваяСтрока.Комментарий = стрДанные.Комментарий;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартГрафикОтсутствияСотрудников.ВидОтсутствия КАК ВидОтсутствия,
	|	смартГрафикОтсутствияСотрудников.Сотрудник КАК Сотрудник,
	|	смартГрафикОтсутствияСотрудников.ДатаНачала КАК ДатаНачала,
	|	смартГрафикОтсутствияСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.смартГрафикОтсутствияСотрудников КАК смартГрафикОтсутствияСотрудников
	|ГДЕ
	|	смартГрафикОтсутствияСотрудников.ВидОтсутствия = &ВидОтсутствия";
	
	Запрос.УстановитьПараметр("ВидОтсутствия", Справочники.смартСтатусыСотрудников.ВОтпуске);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.смартГрафикОтсутствияСотрудников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.ИНН КАК ИНН,
	|	ТЗ.ДатаНачала КАК ДатаНачала,
	|	ТЗ.ДатаОкончания КАК ДатаОкончания,
	|	ТЗ.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанные.ИНН КАК ИНН,
	|	ВТДанные.ДатаНачала КАК ДатаНачала,
	|	ВТДанные.ДатаОкончания КАК ДатаОкончания,
	|	ВТДанные.Комментарий КАК Комментарий,
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|			ПО ФизическиеЛица.Ссылка = Пользователи.ФизическоеЛицо
	|				И (НЕ Пользователи.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|		ПО ВТДанные.ИНН = ФизическиеЛица.ИНН";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Пользователь) Тогда
			Текст = СтрШаблон("Не найден сотрудник с ИНН %1", Выборка.ИНН);
			ЗаписьЖурналаРегистрации("смартHTTPДляЗУП.ЗагрузкаДанныхОбОтпускахPOST.НеНайденСотрудник", УровеньЖурналаРегистрации.Предупреждение,,, Текст);
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.смартГрафикОтсутствияСотрудников.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидОтсутствия = Справочники.смартСтатусыСотрудников.ВОтпуске;
		МенеджерЗаписи.Сотрудник = Выборка.Пользователь;
		МенеджерЗаписи.ДатаНачала = Выборка.ДатаНачала;
		МенеджерЗаписи.ДатаОкончания = Выборка.ДатаОкончания;
		МенеджерЗаписи.Комментарий = Выборка.Комментарий;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыФункции

Функция смартПолучитьПереданныеДанныеИзЗУП(ДанныеЗУП)
	Чтение=Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ДанныеЗУП);
	
	ПолученныеДанные=СериализаторXDTO.ПрочитатьJSON(Чтение);
	
	Чтение.Закрыть();
	
	Возврат ПолученныеДанные;
КонецФункции	

// Смарт Фролов+ Функция поиска или создания Физ. лица по переданным из ЗУП параметрам
// Входные параметры:
// ДанныеФизЛица - Структура с обязательными ключами
//					ИНН строка
//					Фамилия строка
//					Имя строка
//					Отчество строка, может быть пустой строкой
//					ДатаРождения дата
// Возвращаемое заначение Ссылка на Физ. лицо
Функция смартПолучитьСоздатьФизЛицо(ДанныеФизЛица,Ошибки)
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("ИНН",ДанныеФизЛица.ИНН);
	Запрос.УстановитьПараметр("Фамилия",ДанныеФизЛица.Фамилия);
	Запрос.УстановитьПараметр("Имя",ДанныеФизЛица.Имя);
	Запрос.УстановитьПараметр("Отчество",ДанныеФизЛица.Отчество);
	Запрос.УстановитьПараметр("ДатаРождения",ДанныеФизЛица.ДатаРождения);
	
	Запрос.Текст="ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ИНН = &ИНН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|			,
	|			Фамилия=&Фамилия
	|			И Имя=&Имя
	|			И Отчество=&Отчество
	|			И ФизическоеЛицо.ДатаРождения=&ДатаРождения) КАК ФИОФизическихЛицСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|			,
	|			Фамилия=&Фамилия
	|			И Имя=&Имя
	|			И ФизическоеЛицо.ДатаРождения=&ДатаРождения) КАК ФИОФизическихЛицСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|			,
	|			Фамилия=&Фамилия
	|			И Имя=&Имя
	|			И Отчество=&Отчество) КАК ФИОФизическихЛицСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
	|			,
	|			Фамилия=&Фамилия
	|			И Имя=&Имя) КАК ФИОФизическихЛицСрезПоследних";
	
	ТабРез=Запрос.Выполнить().Выгрузить();
	Для П=1 По 5 Цикл 
		НайденныеСтр=ТабРез.НайтиСтроки(Новый Структура("Приоритет",П));
		Если НайденныеСтр.Количество()=0 Тогда
			Ошибки.ЕстьОшибки=Истина;
			Ошибки.Описания.Добавить("Поиск по 'Приоритету' "+П+" не дал результата.");
		ИначеЕсли НайденныеСтр.Количество()=1 Тогда
			ФизЛицо=НайденныеСтр[0].ФизЛицо;
			Если Не ЗначениеЗаполнено(ФизЛицо.ИНН) Или Не ЗначениеЗаполнено(ФизЛицо.ДатаРождения) Или Не ЗначениеЗаполнено(ФизЛицо.Пол) Тогда
				ФизЛицо=ФизЛицо.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ФизЛицо,ДанныеФизЛица);
				Попытка
					ФизЛицо.Записать();
					ФизЛицо=ФизЛицо.Ссылка;
				Исключение
					Ошибки.ЕстьОшибки=Истина;
					Ошибки.Описания.Добавить("Не удалось записать реквизиты Физ. лица");
				КонецПопытки;	
			КонецЕсли;	
			Возврат ФизЛицо;
		Иначе 
			Ошибки.ЕстьОшибки=Истина;
			Ошибки.Описания.Добавить("Поиск по 'Приоритету' "+П+" выдал результат с количеством: "+НайденныеСтр.Количество());
		КонецЕсли;	
	КонецЦикла;	
		
	ФизЛицо=Справочники.ФизическиеЛица.СоздатьЭлемент();
	ФизЛицо.Наименование=ДанныеФизЛица.Фамилия+" "+ДанныеФизЛица.Имя+" "+ДанныеФизЛица.Отчество;
	ЗаполнитьЗначенияСвойств(ФизЛицо,ДанныеФизЛица);
	Попытка
		ФизЛицо.Записать();
	Исключение
		Ошибки.ЕстьОшибки=Истина;
		Ошибки.Описания.Добавить("Не удалось создать новое Физ. лицо. "+ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;	
	
	Возврат ФизЛицо.Ссылка;
КонецФункции	

Процедура смартЗаполнитьДанныеФизЛица(ФизЛицо,ПолученныеДанные,Ошибки)
	ОбъектФизЛицо=ФизЛицо.ПолучитьОбъект();
	
	// Заполняем контактную информацию
	Для Каждого СтрДанные Из ПолученныеДанные.КонтактнаяИнформация Цикл
		Вид=Неопределено;
		Попытка Вид=Справочники.ВидыКонтактнойИнформации[СтрДанные.Вид]; Исключение КонецПопытки;
		Если Не Вид=Неопределено Тогда
			НайденныеСтроки=ОбъектФизЛицо.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип,Вид",СтрДанные.Тип,Вид));
			Если НайденныеСтроки.Количество()=0 Тогда 
				Стр=ОбъектФизЛицо.КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,СтрДанные,,"Вид,ВидДляСписка");
				Стр.Вид=Вид;
				Стр.ВидДляСписка=Вид;
			Иначе
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0],СтрДанные,,"Тип,Вид,ВидДляСписка");
			КонецЕсли;	
		КонецЕсли;			
	КонецЦикла;
	Попытка
		ОбъектФизЛицо.Записать();
	Исключение
		Ошибки.ЕстьОшибки=Истина;
		Ошибки.Описания.Добавить("Не удалось записать контактную информацию Физ. лица. "+ОписаниеОшибки());
	КонецПопытки;	
	
	// Заполняем документы физического лица
	Для Каждого Док Из ПолученныеДанные.Документы Цикл
		Вид=Неопределено;
		Попытка Вид=Справочники.ВидыДокументовФизическихЛиц[Док.ВидДокумента] Исключение КонецПопытки;
		Если Не Вид=Неопределено Тогда 
			МЗ=РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,Док);
			МЗ.Период=ТекущаяДатаСеанса();
			МЗ.Физлицо=ФизЛицо;
			МЗ.ВидДокумента=Вид;
			Попытка
				МЗ.Записать();
			Исключение
				Ошибки.ЕстьОшибки=Истина;
				Ошибки.Описания.Добавить("Не удалось записать документ Физ. лица. "+ОписаниеОшибки());
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура смартЗаполнитьЛицевойСчетФизЛица(ФизЛицо,ЛицевойСчет,Ошибки)
	Банк=Справочники.КлассификаторБанков.НайтиПоКоду(ЛицевойСчет.Банк);
	Если Банк.Пустая() Тогда 
		Ошибки.ЕстьОшибки=Истина;
		Ошибки.Описания.Добавить("Не удалось найти Банк по БИК "+ЛицевойСчет.Банк);
	Иначе
		БанковскийСчет=Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета",ЛицевойСчет.НомерСчета);
		Если БанковскийСчет.Пустая() Тогда 
			БанковскийСчет=Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
		Иначе
			БанковскийСчет=БанковскийСчет.ПолучитьОбъект();
		КонецЕсли;	
		
		БанковскийСчет.Владелец=ФизЛицо;
		БанковскийСчет.Банк=Банк;
		БанковскийСчет.НомерСчета=ЛицевойСчет.НомерСчета;
		БанковскийСчет.ВалютаДенежныхСредств=Константы.ВалютаРегламентированногоУчета.Получить();
		БанковскийСчет.Наименование=ЛицевойСчет.НомерСчета+" "+ЛицевойСчет.Фамилия+" "+ЛицевойСчет.Имя;
		Попытка
			БанковскийСчет.Записать();
		Исключение
			Ошибки.ЕстьОшибки=Истина;
			Ошибки.Описания.Добавить("Не удалось записать лицевой счет "+ЛицевойСчет.НомерСчета+" у Физ. лица "+ФизЛицо);
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры	

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 20.07.2021 12:16:07 задача 583
//Заполняем структуру ответа
Процедура ЗаполнитьСтруктуруОтвета(СтруктураОтвет,КодОтвета,ТекстОшибки,Отработало,ДанныеОтвета)
	СтруктураОтвет.КодОтвета 	= КодОтвета;
	СтруктураОтвет.ТекстОшибки	= ТекстОшибки;
	СтруктураОтвет.Отработало	= Отработало;
	СтруктураОтвет.ДанныеОтвета = ДанныеОтвета;	
КонецПроцедуры

//Смарт }Подкин Алексей Иванович 20.07.2021 12:16:07

#КонецОбласти
